getSelectableElementsWithGivenType(ADocument*,ElementId,DBView*,Arr&lt;ElementId&gt;*)
Only allow elements that can be selected by user in the current state of the document.
In particular:
a) Exclude elements filtered out by ModScopeUtil::isSelectionAllowed;
b) Exclude invisible stuff like symbols, surrogates, and invisible balusters.
c) Exclude anything that is filtered out by box-selection filter chain.
d) Exclude the divided surfaces
Return in pIdArr all elements that have typeId as their type (as defined by what shows up in the Type Selector).
If pDBView is set, find only in the elements of the DBView; otherwise (default), find in the entire model.
Return the number found.